import sqlite3

def setup_database():
    conn = sqlite3.connect('game_words.db')
    cursor = conn.cursor()

    cursor.execute(f'DROP TABLE IF EXISTS wordle_words')

    cursor.execute(f'DROP TABLE IF EXISTS riddle_words')


    cursor.execute('''CREATE TABLE IF NOT EXISTS wordle_words (
                        id INTEGER PRIMARY KEY,
                        word TEXT NOT NULL)''')

    cursor.execute('''CREATE TABLE IF NOT EXISTS riddle_words (
                        id INTEGER PRIMARY KEY,
                        riddle TEXT NOT NULL,
                        answer TEXT NOT NULL)''')

    #WORD AND RIDDLE DATA

    wordle_words = ['пазар', 'пачка', 'порив', 'попче','домат','варна','кисел','дърво','цвете','самбо','здрав','момък','солен','шумен','котка',
                    'мечка','пъпеш','тиква','круша','масло','пчела','вятър','тигър','лъвче','комар','камък','метла','бомба','зебра','листо','трева','цвете','водач','ръчка',
                    'очила','чорап','бъчва','маска','химик','шапка']
    riddle_words = [
        ('Труди се направо здраво и надясно, и наляво.', 'ключ'), ('От мен запомни: каквото и да правиш, \n в тези вълни няма да се удавиш.', 'радиовълни'), 
        ('Скромна е моята щерка, знам, \n но я целуват всички с план.','чаша'), ('Те са заводски тръби, но дълго не траят. \n Само трапезите може би защо е така не знаят.','макарони'), 
        ('Вар-варосано, зид-зидосано, \n без врата и без прозорци.','яйце'), ('Това нещо не е горещо, а пари, \n а гори и в хладилника дори.','черен пипер'), 
        ('Вън върви една другарка - най-голямата цветарка. \n Дето стъпи, дето мине - по ливади, \n по градини пръска шарени цветя.','пролет'), ('Рисува от сърце без бои и без \n ръце и багри полята с хиляда цвята.','есен'), 
        ('Роди ме майка голяма, отхрани ме \n слънце златно, но ще умра, ако \n мама ме вземе обратно.','морска сол'), ('Кон препуска, боже мили, и над \n Дунав грива мята, падна - и така \n зацвили, че разтресе се земята.','гръм'), 
        ('Все яде и никога \n не се наяжда','огън'), ('Не потъва този кон ни сега, ни \n преди, макар че във вода е до гърди','лодка'),
        ('Един с комин крачи и влачи къщи \n без комини сред простори сини','локомотив'), ('Ходи Мира все край вира','патица')
    ]


    cursor.executemany('INSERT INTO wordle_words (word) VALUES (?)', [(word,) for word in wordle_words])
    cursor.executemany('INSERT INTO riddle_words (riddle, answer) VALUES (?, ?)', riddle_words)

    conn.commit()
    conn.close()
